In [4]:
import pandas as pd
df=pd.read_csv("student.csv")
df

   Reg.no    M1    M2    M3 Result
0     100  85.0  78.0  92.0   Pass
1     101  56.0   NaN  60.0   Fail
2     102   NaN  85.0  80.0   Pass
3     103  90.0  88.0  94.0   Pass
4     104  45.0  55.0  50.0   Fail
5     105  63.0  72.0   NaN   Pass

In [5]:
df.head(2)

   Reg.no    M1    M2    M3 Result
0     100  85.0  78.0  92.0   Pass
1     101  56.0   NaN  60.0   Fail

In [6]:
df.tail(2)

   Reg.no    M1    M2    M3 Result
4     104  45.0  55.0  50.0   Fail
5     105  63.0  72.0   NaN   Pass